package PPP;

import java.util.Arrays;

public class P {
    public static void main(String[] args) {
        PP project = new PP();
//		project.P00(9);
		project.P0(999);
        project.P1(5);//题目：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子对数为多少？
        project.P2(100, 200);//题目：判断101-200之间有多少个素数，并输出所有素数。
        project.P3(0);//题目：打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该数本身。例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。
        project.P4(90);//题目：将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5。
        project.P5(85);//题目：利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学用A表示，60-89分之间的用B表示，60分以下的用C表示。
        //project.P6(3,12);//题目：输入两个正整数m和n，求其最大公约数和最小公倍数。
        //project.P7();//题目：输入一行字符，分别统计出其英文字母、空格、数字和其它字符的个数。
        project.P8(2, 5);//题目：求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。例如2+22+222+2222+22222(此时共有5个数相加)，几个数相加有键盘控制。输出结果的形式如：2+22+222=246；
        project.P9(1000);
        project.P10(2, 2);//题目：一球从h米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第n次落地时，共经过多少米？第n次反弹多高？
        project.P11();//题目：有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少？
        project.P12(100);//企业发放的奖金根据利润提成。
        project.P13(99999);//题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
        project.P15(3, 6, 9);//题目15：输入三个整数x,y,z，请把这三个数由小到大输出。
        project.P16(9, 9);//题目：输出9*9口诀。
        project.P17(10);//题目：猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个第二天早上又将剩下的桃子吃掉一半，又多吃了一个。以后每天早上都吃了前一天剩下的一半零一个。到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少。
        project.P18();//题目：两个乒乓球队进行比赛，各出三人。甲队为a,b,c三人，乙队为x,y,z三人。已抽签决定比赛名单。有人向队员打听比赛的名单。a说他不和x比，c说他不和x,z比，请编程序找出三队赛手的名单。
        project.P19();//题目：打印出如下图案（菱形）
        project.P20();//题目：有一分数序列：2/1，3/2，5/3，8/5，13/8，21/13...求出这个数列的前20项之和。
        project.P21();//题目：求1+2!+3!+...+20!的和
        project.P22(5);//题目：利用递归方法求5!。
        project.P23(10, 5);//
        project.P24(1111);//题目：给一个不多于5位的正整数，要求：一、求它是几位数，二、逆序打印出各位数字。
        project.P26("t", "u", "a");//题目26：请输入星期几的第一个字母来判断一下是星期几，如果第一个字母一样，则继续判断第二个字母。
        project.P27(100);//题目27：求100之内的素数
        project.P28();//题目28：对10个数进行排序
        project.P32(12345678);//题目32：取一个整数a从右端开始的4～7位。
        project.P34(5, 6, 7);//题目34：输入3个数a,b,c，按大小顺序输出。
        project.P38("a阿1");//题目38：写一个函数，求一个字符串的长度，在main函数中输入字符串，并输出其长度。
        project.P41(5);
        project.P42();//题目42：809*??=800*??+9*??+1 其中??代表的两位数,8*??的结果为两位数，9*??的结果为3位数。求??代表的两位数，及809*??后的结果。
        project.P43(8);
        project.P44(10);
        project.P45(18);//题目45：判断一个素数能被几个9整除
        project.P46("idsdik","dsadasd");//题目46：两个字符串连接程序
    }
}
